project/app/controllers/bookings_controller.rb

SELECT "client".* FROM "client" WHERE "client"."client_id" = 19
SELECT "master".* FROM "master" WHERE "master"."master_id" = 13
SELECT "service".* FROM "service" WHERE "service"."service_id" = 17
SELECT "booking".* FROM "booking"
SELECT "client".* FROM "client" WHERE "client"."client_id" IN (1, 2, 3, 4, 5)
SELECT "master".* FROM "master" WHERE "master"."master_id" IN (1, 2, 3, 4, 5)
SELECT "service".* FROM "service" WHERE "service"."service_id" IN (1, 2, 3, 5, 7, 9, 4, 6, 10)
---
    def index
        bookings = StrategyDb.Booking.includes(:client, :master, :service)

        bookings = bookings.where(status: params[:status]) if params[:status]

SELECT "booking".* FROM "booking" WHERE "booking"."booking_id" = 11 LIMIT 1
---
    def set_booking
        @booking = StrategyDb.Booking.find(params[:id])