project/app/controllers/clients_controller.rb

    def index
        render json: Client.all
---
SELECT "client".* FROM "client"

    def set_client
        @client = Client.find(params[:id])
---
SELECT "client".* FROM "client" WHERE "client"."client_id" = 7 LIMIT 1