project/app/controllers/masters_controller.rb

    def index
        masters =
        if params[:active] == 'true'
            StrategyDb.Master.active
        elsif params[:active] == 'false'
            StrategyDb.Master.inactive
        else
            StrategyDb.Master.all
---
SELECT "master".* FROM "master"

    def set_master
        @master = StrategyDb.Master.find(params[:id])
---
SELECT "master".* FROM "master" WHERE "master"."master_id" = 6 LIMIT 1