project/app/controllers/services_controller.rb

    def index
        render json: Service.all
---
SELECT "service".* FROM "service"

    def set_service
        @service = Service.find(params[:id])
---
SELECT "service".* FROM "service" WHERE "service"."service_id" = 17 LIMIT 1