INSERT INTO service (title, duration, base_price, category) VALUES
('Женская стрижка', 100, 2500, 'Стрижка'),
('Мужская стрижка', 40, 1500, 'Стрижка'),
('Окрашивание в один тон', 120, 4500, 'Окрашивание'),
('Сложное окрашивание', 200, 7500, 'Окрашивание'),
('Классический маникюр', 120, 2000, 'Маникюр'),
('Аппаратный педикюр', 150, 2800, 'Педикюр'),
('Вечерний макияж', 210, 3500, 'Визаж'),
('Депиляция воском (ноги)', 110, 2200, 'Депиляция'),
('Расслабляющий массаж', 100, 3200, 'Массаж'),
('Чистка лица', 40, 4000, 'Косметология');