INSERT INTO master (last_name, first_name, patronymic, phone_number, is_active) VALUES
('Смирнов', 'Александр', 'Викторович', '+79102345678', TRUE),
('Ковалева', 'Екатерина', 'Игоревна', '89212345679', TRUE),
('Петрова', 'Ольга', 'Сергеевна', '+79122345680', TRUE),
('Николаев', 'Михаил', 'Александрович', '89222345681', TRUE),
('Захарова', 'Анна', 'Дмитриевна', '+79132345682', FALSE), -- Неактивный мастер
('Федоров', 'Денис', 'Владимирович', '89232345683', TRUE),
('Мельникова', 'Светлана', 'Алексеевна', '+79142345684', TRUE);