INSERT INTO service (title, duration, base_price, category) VALUES
('Женская стрижка', '01:00:00', 2500, 'Cтрижка'),
('Мужская стрижка', '00:45:00', 1500, 'Cтрижка'),
('Окрашивание в один тон', '02:30:00', 4500, 'Окрашивание'),
('Сложное окрашивание', '03:30:00', 7500, 'Окрашивание'),
('Классический маникюр', '01:30:00', 2000, 'Маникюр'),
('Аппаратный педикюр', '01:45:00', 2800, 'Педикюр'),
('Вечерний макияж', '01:15:00', 3500, 'Визаж'),
('Депиляция воском (ноги)', '01:00:00', 2200, 'Депиляция'),
('Расслабляющий массаж', '01:15:00', 3200, 'Массаж'),
('Чистка лица', '01:30:00', 4000, 'Косметология');