project/app/command/update_command.rb

    def execute
        @entity.update!(@client_params)
---
UPDATE "client" SET "patronymic" = 'Будущиевич' WHERE "client"."client_id" = 19