project/app/reports_service/real_report_service.rb

    def master_efficiency_report(start_date, end_date,status = 'Выполнена', is_active=true)
        results = Booking
        .joins(:master, :service)
        .references(:master, :service)
        .where(status: status)
        .where(master: { is_active: is_active})
        .where('date_service BETWEEN ? AND ?', start_date, end_date)
        .group('master.master_id', 'service.category', 'service.title')
        .select(
            'master.master_id as master_id',
            "master.last_name || ' ' || master.first_name as master_name",
            'service.category',
            'service.title as service_name',
            'COUNT(DISTINCT booking.client_id) as unique_clients_count',
            'COUNT(booking.booking_id) as total_bookings',
            'SUM(booking.price) as total_revenue',
            'ROUND(AVG(booking.price), 2) as average_price',
            'MIN(booking.date_service) as first_booking_date',
            'MAX(booking.date_service) as last_booking_date'
        )
        .order('total_revenue DESC, total_bookings DESC')

        formatted_results = results.map do |booking|
        first_date = booking.first_booking_date
---
SELECT master.master_id as master_id, master.last_name || ' ' || master.first_name as master_name, "service"."category", service.title as service_name, COUNT(DISTINCT booking.client_id) as unique_clients_count, COUNT(booking.booking_id) as total_bookings, SUM(booking.price) as total_revenue, ROUND(AVG(booking.price), 2) as average_price, MIN(booking.date_service) as first_booking_date, MAX(booking.date_service) as last_booking_date FROM "booking" INNER JOIN "master" ON "master"."master_id" = "booking"."master_id" INNER JOIN "service" ON "service"."service_id" = "booking"."service_id" WHERE "booking"."status" = 'Выполнена' AND "master"."is_active" = TRUE AND (date_service BETWEEN '2025-12-19' AND '2026-01-19') GROUP BY "master"."master_id", "service"."category", "service"."title" ORDER BY total_revenue DESC, total_bookings DESC

    def client_analytics_report(status='Выполнена')
        client_stats = Booking.joins(:client)
                                .where(status: status)
                                .group('client.client_id', 'client.first_name', 'client.last_name', 'client.phone_number','client.registration_date')
                                .select(
                                    'client.client_id as client_id',
                                    "client.first_name || ' ' || client.last_name as client_name",
                                    'client.phone_number as phone_number',
                                    'client.registration_date as registration_date',
                                    'SUM(booking.price) as total_spent',
                                    'COUNT(booking.booking_id) as total_bookings',
                                    'AVG(booking.price) as average_spent_per_booking',
                                    'MIN(booking.date_service) as first_booking_date',
                                    'MAX(booking.date_service) as last_booking_date'
                                    )
        formatted_results = client_stats.map do |client|
            favorite_service = Booking.joins(:service)
                                        .where(client_id: client.client_id)
                                        .group('service.category')
                                        .order('COUNT(booking.booking_id) DESC')
                                        .limit(1)
                                        .pluck('service.category')
                                        .first
            favorite_master = Booking.joins(:master)
                                        .where(client_id: client.client_id)
                                        .group('master.master_id')
                                        .order('COUNT(booking.booking_id) DESC')
                                        .limit(1)
                                        .pluck(Arel.sql("master.first_name || ' ' || master.last_name"))
                                        .first
            unique_visit_days= Booking.where(client_id: client.client_id)
                                        .select('DISTINCT DATE(date_service)')
                                        .count
---
SELECT client.client_id as client_id, client.first_name || ' ' || client.last_name as client_name, client.phone_number as phone_number, client.registration_date as registration_date, SUM(booking.price) as total_spent, COUNT(booking.booking_id) as total_bookings, AVG(booking.price) as average_spent_per_booking, MIN(booking.date_service) as first_booking_date, MAX(booking.date_service) as last_booking_date FROM "booking" INNER JOIN "client" ON "client"."client_id" = "booking"."client_id" WHERE "booking"."status" = 'Выполнена' GROUP BY "client"."client_id", "client"."first_name", "client"."last_name", "client"."phone_number", "client"."registration_date"
SELECT "service"."category" FROM "booking" INNER JOIN "service" ON "service"."service_id" = "booking"."service_id" WHERE "booking"."client_id" = 3 GROUP BY "service"."category" ORDER BY COUNT(booking.booking_id) DESC LIMIT 1
SELECT master.first_name || ' ' || master.last_name FROM "booking" INNER JOIN "master" ON "master"."master_id" = "booking"."master_id" WHERE "booking"."client_id" = 3 GROUP BY "master"."master_id" ORDER BY COUNT(booking.booking_id) DESC LIMIT 1
SELECT COUNT(DISTINCT DATE(date_service)) FROM "booking" WHERE "booking"."client_id" = 3

    def operational_efficiency_report(status = 'Выполнена')
        results = Booking
        .joins(:master, :service)
        .where(status: status)
        .group(
            'master.master_id',
            'master.last_name',
            'master.first_name',
            'service.category',
            'DATE(date_service)',
            'EXTRACT(DOW FROM date_service)',
            "TO_CHAR(date_service, 'HH24')"
        )
        .select(
            'master.master_id',
            "master.last_name || ' ' || LEFT(master.first_name, 1) || '.' as master_short",
            'master.is_active',

            'service.category',

            'DATE(date_service) as booking_date',
            'EXTRACT(DOW FROM date_service) as day_of_week',
            "TO_CHAR(date_service, 'HH24') as hour",

            'COUNT(*) as bookings_count',
            'SUM(service.duration) as total_minutes',
            'SUM(booking.price) as total_revenue',
            'COUNT(DISTINCT booking.client_id) as unique_clients'
        )
        .order('booking_date DESC, master.master_id')
---
SELECT "master"."master_id", master.last_name || ' ' || LEFT(master.first_name, 1) || '.' as master_short, "master"."is_active", "service"."category", DATE(date_service) as booking_date, EXTRACT(DOW FROM date_service) as day_of_week, TO_CHAR(date_service, 'HH24') as hour, COUNT(*) as bookings_count, SUM(service.duration) as total_minutes, SUM(booking.price) as total_revenue, COUNT(DISTINCT booking.client_id) as unique_clients FROM "booking" INNER JOIN "master" ON "master"."master_id" = "booking"."master_id" INNER JOIN "service" ON "service"."service_id" = "booking"."service_id" WHERE "booking"."status" = 'Выполнена' GROUP BY "master"."master_id", "master"."last_name", "master"."first_name", "service"."category", DATE(date_service), EXTRACT(DOW FROM date_service), TO_CHAR(date_service, 'HH24') ORDER BY booking_date DESC, master.master_id