project/app/models/Booking.rb

SELECT SUM("service"."duration") FROM "booking" INNER JOIN "service" ON "service"."service_id" = "booking"."service_id" WHERE "booking"."client_id" = 57 AND "booking"."date_service" BETWEEN '2026-01-21 00:00:00' AND '2026-01-21 23:59:59.999999'
---
    def client_daily_duration_limit
        return if client.blank? || service.blank? || date_service.blank?

        day_start = date_service.beginning_of_day
        day_end   = date_service.end_of_day

        total_minutes = Booking
            .joins(:service)
            .where(client_id: client_id)
            .where(date_service: day_start..day_end)
            .sum('service.duration')

SELECT SUM("service"."duration") FROM "booking" INNER JOIN "service" ON "service"."service_id" = "booking"."service_id" WHERE "booking"."master_id" = 50 AND "booking"."date_service" BETWEEN '2026-01-21 00:00:00' AND '2026-01-21 23:59:59.999999'
---
    def master_daily_workload
        return if master.blank? || service.blank? || date_service.blank?

        day_start = date_service.beginning_of_day
        day_end   = date_service.end_of_day

        total_minutes = Booking
            .joins(:service)
            .where(master_id: master_id)
            .where(date_service: day_start..day_end)
            .sum('service.duration')

SELECT COUNT(*) FROM "booking" WHERE "booking"."client_id" = 57 AND "booking"."status" = 'Неявка' AND (created_at >= '2025-12-21 13:45:33.261828')
---
    def client_no_show_block
        return if client.blank?

        one_month_ago = 1.month.ago

        no_show_count = Booking
            .where(client_id: client_id, status: 'Неявка')
            .where('created_at >= ?', 1.month.ago)
            .count

SELECT COUNT(*) FROM "booking" WHERE "booking"."client_id" = 57 AND "booking"."status" = 'Подтверждена' AND (date_service > '2026-01-21 13:45:33.257718')
---
    def client_future_bookings_limit
        return if client.blank? || date_service.blank?

        future_confirmed_count = Booking
            .where(client_id: client_id, status: 'Подтверждена')
            .where('date_service > ?', Time.current)
            .count